IDENTIFICATION DIVISION.
PROGRAM-ID. COLLATZ-CONJECTURE-IN-COBOL.
AUTHOR. DrParanoya.
DATE-WRITTEN. 02-OCT-2025
*> COBOL was suprisingly fun
*> I might write more COBOL in the future

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM PIC 9(9) VALUE 0.
01 PEAK PIC 9(9) VALUE 0.
01 STEPS PIC 9(9) VALUE 0.
01 STARTTIME PIC 9(9) VALUE 0.
01 ENDTIME PIC 9(9) VALUE 0.
       
PROCEDURE DIVISION.
DISPLAY "PLEASE ENTER A POSTIVE INTEGER TO RUN THE COLLATZ CONJECTURE ON:".
ACCEPT NUM.
ACCEPT STARTTIME FROM TIME.
PERFORM LOOP UNTIL NUM = 1.
ACCEPT ENDTIME FROM TIME.
SUBTRACT STARTTIME FROM ENDTIME.
DISPLAY "STEPS TO REACH 1: " STEPS ". PEAK NUMBER REACHED: " PEAK ". TOOK " ENDTIME.
STOP RUN.

LOOP.
IF FUNCTION MOD (NUM, 2) = 0
	DIVIDE NUM BY 2 GIVING NUM
ELSE
	MULTIPLY NUM BY 3 GIVING NUM
	ADD 1 TO NUM
END-IF.
ADD 1 TO STEPS.
IF NUM > PEAK
	MOVE NUM TO PEAK
END-IF.
